*** 1.3.3　Linux的由来

如果Linus就这么干下去，估计到今天只会有两种结果。

（1）成家立业后的Linus经常指着他的电脑C盘里面的一个文件夹对来访的朋友说：看，我那时候还写过一个FREAX系统。
# 有意思的想象, 脑洞大开的优秀作者.
（2）Linus为完成FREAX系统挑灯夜战，最终累得吐血身亡，永远活在我们心中。

总之，如果他一直自己干下去，就不会有Linux这个东西了，因为一个人的力量是有限的。有道是人多力量大，众人拾柴火焰高。Linus深刻明白这一点，他没有独自在家闭门造车，而是让他的操作系统和互联网，亲密接触了。

“Hello everybody out there using minix------I'm doing a (free) operating
system.”这是他当年在comp.os.minix上发布的消息，告诉大家，他正在写一个操作系统。并且，他还把他写的“异想天开”操作系统的代码上传到ftp.funet.fi的服务器上供大家下载，以便交流心得，共同学习。这就相当于你跑到网站上发帖子说：我研究出一种萝卜炖牛腩的方法，主料是啥啥啥，配料是啥啥啥，怎么怎么炖，大家都试试吧！（对不起，我又饿了）于是很多有兴趣的人就来尝Linus炖的牛腩，哦不对，是尝试Linus写的系统。不过当时那个服务器的管理员Ari
Lemke看着这个异想天开的名字就不顺眼。想想，既然是Linus写的操作系统，又是类UNIX的，干脆，叫Linux吧。

这里先要说一个概念，Linux是什么？狭义地讲，Linux只是一个操作系统的内核，它只是各位的Ubuntu系统里面/boot/目录下的那个内核文件vmlinuz-x.x.xx-xx-generic。就好比汽车，Linux只是一个引擎而已，只是大家普遍习惯把装了Linux这种引擎的汽车叫做Linux汽车。那么既然Linux只是一个内核，要想工作，就还需要很多周边软件的支持，比如文件系统；比如一个命令行程序；比如一些基本的软件。这些东西加在一起成为一个系统，其实应该叫做GNU/Linux系统。不过为了符合平时习惯，本书后面如无特别声明，所提到的Linux都指GNU/Linux系统。
#+BEGIN_SRC shell :results output
ls /boot
#+END_SRC

#+RESULTS:
#+begin_example
config-5.3.0-18-generic
config-5.3.0-19-generic
efi
grub
initrd.img
initrd.img-5.3.0-18-generic
initrd.img-5.3.0-19-generic
initrd.img.old
memtest86+.bin
memtest86+.elf
memtest86+_multiboot.bin
System.map-5.3.0-18-generic
System.map-5.3.0-19-generic
vmlinuz
vmlinuz-5.3.0-18-generic
vmlinuz-5.3.0-19-generic
vmlinuz.old
#+end_example

